#+title: Patching Age of Wonders
#+Date: 2023-06-03
#+Draft: true
#+Tags[]: reverse-engineering, games
#+PROPERTY: header-args :eval never-export

After the update two limitations, max level and not being able to train the hero
and leader on the arena.


#+begin_example
TODO

change the loop instead, change the 5 for 9
and then theh add esi executes, add a static number there
do this for both level -> xp, and xp -> level

│      ╎│   0x557876ea      bd05000000     mov ebp, 5
│      ╎│   0x557876ef      99             cdq
│      ╎│   0x557876f0      f7fd           idiv ebp
│      ╎│   0x557876f2      0334c5b8848e.  add esi, dword [eax*8 + 0x558e84b8]

#+end_example

- [ ] Add note that this is a literate document

** Nixos setup
Literate programming using Emacs, Babel, Nixos and Radare2

If you have the game installed via Steam:

#+begin_src bash :session reverse
nix-shell -p radare2 --command "radare2 -w ~/.local/share/Steam/steamapps/common/Age\ of\ Wonders/AoWEPACK.dpl"
#+end_src

#+begin_src reverse
iS
#+end_src

#+RESULTS:
: 0x55701000 0x558e7a00 -r-x CODE
: 0x558e8000 0x558e9c00 -rw- DATA
: 0x558ea000 0x558ea000 -rw- BSS
: 0x558fb000 0x5590b200 -rw- .idata
: 0x5590c000 0x55985800 sr-- .edata
: 0x55986000 0x55986200 sr-- .rdata
: 0x55987000 0x559a6e00 sr-- .reloc
: 0x559a7000 0x559bce00 sr-- .rsrc

#+begin_src reverse :session reverse :target "AoWEPACK.dpl"
s 0x557d699c
af
pdf
#+end_src


* Starting the session

Header argument =:target= points to the binary file

#+begin_src reverse :session reverse :target "AoWEPACK.dpl"
aaa
iS
#+end_src

#+RESULTS:
: INFO: Analyze all flags starting with sym. and entry0 (aa)

*** Patch unit costs for Heroes and Leaders
#+begin_example
[0x5580bde8]> iS
[Sections]

nth paddr           size vaddr          vsize perm type name
――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――
0   0x00000400  0x1e6a00 0x55701000  0x1e7000 -r-x ---- CODE
1   0x001e6e00    0x1c00 0x558e8000    0x2000 -rw- ---- DATA
2   0x001e8a00       0x0 0x558ea000   0x11000 -rw- ---- BSS
3   0x001e8a00   0x10200 0x558fb000   0x11000 -rw- ---- .idata
4   0x001f8c00   0x79800 0x5590c000   0x7a000 sr-- ---- .edata
5   0x00272400     0x200 0x55986000    0x1000 sr-- ---- .rdata
6   0x00272600   0x1fe00 0x55987000   0x20000 sr-- ---- .reloc
7   0x00292400   0x15e00 0x559a7000   0x16000 sr-- ---- .rsrc
#+end_example

#+begin_src python :results output
print("Area suitable for a code cave 0x55701000 -> "+str(hex(0x55701000 + 0x1e7000 )))
#+end_src

#+RESULTS:
: Area suitable for a code cave 0x55701000 -> 0x558e8000


JMP 5580bf00

patch

│       │   0x557d6719      83c8ff         or eax, 0xffffffff
│       │   0x557d671c      5e             pop esi
│       │   0x557d671d      5b             pop ebx
│       │   0x557d671e      c3             ret

to

Sections to find a code cave
Code cave

#+begin_example
[0x5580bde8]> s 0x5580bf00
[0x5580bf00]> pd 5
│           0x5580bf00      31c0           xor eax, eax
│           0x5580bf02      b8fa000000     mov eax, 0xfa               ; 250
│           0x5580bf07      5e             pop esi
│           0x5580bf08      5b             pop ebx
└           0x5580bf09      c3             ret
#+end_example

